<div class="wrapper-task">
  <h2>Задание 4</h2>
  <p>В файле урлы_на_проверку.xlsx содержится список реальных урлов, загруженных в один аккаунт на площадке Яндекс.Директ. Часть из этих урлов работает не так, как нужно. Необходимо найти и исправить все ошибки.</p>
  <p>Не нужно "в лоб" перебирать все урлы и ходить на сайт клиента. Задача не на проверку статусов ответа сервера.</p>
   <p>Постарайтесь представить результрующие данные в таком виде, чтобы их можно было легко использовать. Например, не нужно писать "нормальные" и "ошибочные" урлы в разные файлы. Обратите внимание на наличие идентификаторов урлов.</p>
  <h3>Решение</h3>
  <h3>файл для задания находится test/upload_file/task4/url.xlsx</h3>
  <h3>Список урлов, который не похожи на основную массу. Что с ними делать - пока думаю. решения пока нет</h3>
  <pre>
  <?php $urls = $task4->show_report(); ?>
  </pre>
</div>